app/views/grocery_lists/index.html.erb

        <td><%= grocery_list.name %></td>
				<td><%= grocery_list.items.count %></td>
---
SELECT COUNT(*) FROM "items" WHERE "items"."grocery_list_id" = ?  [["grocery_list_id", 1]]