app/views/orders/_form.html.erb

    <%= f.label :grocery_list_id %><br>
    <%= f.select :grocery_list_id, GroceryList.for_user(current_user).map { |g| [g.name, g.id] }, prompt: 'Choose...' %>
---
SELECT  "grocery_lists".* FROM "grocery_lists" WHERE (user_id = 1)  ORDER BY "grocery_lists"."id" ASC LIMIT 1