app/views/orders/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "grocery_lists".* FROM "grocery_lists" WHERE "grocery_lists"."id" = ? LIMIT 1  [["id", 1]]
---
				<td><%= order.delivery_time.strftime('%B %e, %Y %I:%M %P') %></td>
        <td><%= (User.find(order.buyer_id)).name %></td>
        <td><%= (User.find(order.shopper_id)).name %></td>
        <td><%= (GroceryList.find(order.grocery_list_id)).name %></td>