app/views/orders/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1
---
		<td>Buyer</td>
    <td><%= link_to User.find(@order.buyer_id).proper_name, user_path(@order.buyer_id) %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1
---
		<% else %>
    	<td><%= link_to User.find(@order.shopper_id).proper_name, user_path(@order.shopper_id) %></td>