app/controllers/grocery_lists_controller.rb

  def index
    @grocery_lists = GroceryList.for_user(current_user).all
---
SELECT "grocery_lists".* FROM "grocery_lists" WHERE (user_id = 1)

  def show
    @items = @grocery_list.items.all
---
SELECT "items".* FROM "items" WHERE "items"."grocery_list_id" = ?  [["grocery_list_id", 1]]

  def create
    @grocery_list = GroceryList.new(grocery_list_params)

    if @grocery_list.save
---
INSERT INTO "grocery_lists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test List"], ["user_id", 1], ["created_at", "2015-03-20 18:25:01.438091"], ["updated_at", "2015-03-20 18:25:01.438091"]]

  def destroy
    @grocery_list.destroy
---
DELETE FROM "grocery_lists" WHERE "grocery_lists"."id" = ?  [["id", 3]]

    def set_grocery_list
      @grocery_list = GroceryList.find(params[:id])
---
SELECT  "grocery_lists".* FROM "grocery_lists" WHERE "grocery_lists"."id" = ? LIMIT 1  [["id", 8]]