app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "amount", "grocery_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["amount", "2"], ["grocery_list_id", 1], ["created_at", "2015-03-04 21:34:43.590117"], ["updated_at", "2015-03-04 21:34:43.590117"]]