app/controllers/orders_controller.rb

  def complete
    @order.complete = true
    @order.save
---
UPDATE "orders" SET "complete" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["complete", "t"], ["updated_at", "2015-05-01 21:51:45.966308"], ["id", 3]]

  def shopping
    u_id = current_user.id
    @orders = Order.where("shopper_id = ? AND complete = ?", u_id, false).all
---
SELECT "orders".* FROM "orders" WHERE "orders"."shopper_id" = 1

  def accept_order
    @order.shopper_id = current_user.id
    @order.save
---
UPDATE "orders" SET "shopper_id" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["shopper_id", 1], ["updated_at", "2015-05-01 19:04:10.958545"], ["id", 4]]

  def my_orders
    u_id = current_user.id
    @completed = Order.where("buyer_id = ? AND complete = ?", u_id, true).all
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 1

  def index
    u_id = current_user.id
    @orders = Order.where("shopper_id IS NULL AND complete = ? AND buyer_id <> ?", false, u_id).all
---
SELECT "orders".* FROM "orders" WHERE "orders"."shopper_id" IS NULL

  def show
    @items = Item.where(grocery_list_id: @order.grocery_list_id).all
---
SELECT "items".* FROM "items" WHERE "items"."grocery_list_id" = ?  [["grocery_list_id", 1]]

  def create
    @order = Order.new(order_params)

    if @order.save
---
INSERT INTO "orders" ("tip", "notes", "store", "grocery_list_id", "buyer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tip", 4], ["notes", "test"], ["store", "5"], ["grocery_list_id", 1], ["buyer_id", 1], ["created_at", "2015-04-08 00:12:17.580309"], ["updated_at", "2015-04-08 00:12:17.580309"]]

  def update
    if @order.update(order_params)
---
UPDATE "orders" SET "notes" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["notes", "Organic please!"], ["updated_at", "2015-03-28 20:43:16.395765"], ["id", 2]]