app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."phone_number" = ? LIMIT 1  [["phone_number", "1234567890"]]
---
  def create
    user = User.find_by_phone_number(params[:phone_number])