app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "phone_number", "location", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$u1jCe3Ix.Tv.5.PHYAak7eWQlXbPHFd31oJYa2XQzFnSlDyq5H8Eu"], ["updated_at", "2015-03-28 19:19:16.084472"], ["id", 1]]
---
  def update
    # @user = current_user # User.find(params[:id])
    if @user.update_attributes(user_params)