app/models/order.rb

SELECT COUNT(*) FROM "items" WHERE "items"."grocery_list_id" = ?
---
  def num_items
    Item.where(grocery_list_id: grocery_list_id).count